artillery/root.yml
config:
  environments:
    gunicorn:
      target: 'http://localhost:5001'
      plugins:
        statsd:
          host: "localhost"
          port: 8125
          prefix: "gunicorn"
    flask:
      target: 'http://localhost:5000'
      plugins:
        statsd:
          host: "localhost"
          port: 8125
          prefix: "flask"
    node:
      target: 'http://localhost:5002'
      plugins:
        statsd:
          host: "localhost"
          port: 8125
          prefix: "node"
  phases:
    - name: RampUp
      duration: 30
      arrivalRate: 5
      rampTo: 20
    - name: Intensive
      duration: 60
      arrivalRate: 20
    - name: Stop
      pause: 5
    - name: Quite
      duration: 30
      arrivalRate: 5
scenarios:
  - root:
    flow:
      - get:
          url: "/"